"""
1. Є дев'ятиповерховий будинок, в якому 4 під'їзди. Номер під'їзду починається з одиниці.
На одному поверсі - 4 квартири.
Напишіть програму, яка від користувача отримує номер квартири та
виводить для заданої квартири номер під'їзду, поверху та номер на поверсі.
Якщо такої квартира немає в цьому будинку, то необхідно повідомити користувача про це.
"""
n = int(input())
print(f'entrance {(n - 1) // 36 + 1}, floor {(n - 1) % 36 // 4 + 1}') or print(f'Oops!', n > 144)

"""
2. Написати програму, яка буде повертати для заданого року кількість днів.
Рік є високосним, якщо він кратний 4, але не кратний 100, а також якщо він кратний 400
"""
n = int(input("year - "))
a = "leap_year - 366 days"
b = "normal_year - 365 days"

if n % 4 == 0 and n % 100 != 0 or n % 400 == 0:
    print(a)
else:
    print(b)

# Другий варіант за допомогою match

match n:
    case n if n % 4 == 0 and n % 100 != 0 or n % 400 == 0:
        print("leap_year - 366 days")
    case _:
        print("normal_year - 365 days")

"""
3. Трикутник існує лише тоді, коли сума будь-яких двох сторін більше третьої.
Дано: A, B, C - сторони трикутника. Напишіть програму, яка вказує чи існує такий трикутник.
"""
x = 'triangle'
a = float(input("First side - "))
b = float(input("Second side - "))
c = float(input("Third side - "))

match x:
    case x if (a + b <= c) or (a + c <= b) or (b + c <= a):
        print("Invalid")
    case _:
        print('Valid')
