'''
1. Написати Python-скрипт, який виводить на екран усі числа в діапазоні від 1 до 100 кратні 7.
'''

number = 0
while number < 100:
    number += 1
    if number % 7 != 0:
        continue
    print(number)

'''
2. Написати Python-скрипт, який обчислює за допомогою циклу факторіал числа n (n вводиться з клавіатури).
'''

n = int(input('Please, enter a number - '))
factorial = 1
while n > 1:
    factorial = factorial * n
    n = n - 1
print(factorial)

'''
3. Написати Python-скрипт, який виводить на екран таблицю множення на 5.
Переважно друкувати 1 x 5 = 5, 2 x 5 = 10, а не просто 5, 10, ...
'''

j = 5
for i in range(1, 10):
    print(i, '*', j, '=', i * j)
print()

'''
4. Написати Python-скрипт, який виводить на екран прямокутник із '*'.
Висота і ширина прямокутника вводяться з клавіатури.
'''

cols = int(input('number of columns - '))
print('*' * cols)
for rows in range(cols - 3):
    print('*', ' ' * (cols - 4), '*')
print('*' * cols)

'''
5. Є список [0,5,2,4,7,1,3,19]. Написати Python-скрипт для підрахунку непарних цифр у ньому.
'''

for x in [0, 5, 2, 4, 7, 1, 3, 19]:
    if not x % 2 == 0:
        print(x)

'''
6. Створіть список випадкових чисел (розміром 4 елементи).
Створіть другий список у два рази більше першого,
де перші 4 елементи повинні дорівнювати елементам першого списку,
а решта елементів - подвоєним значенням початкових.

Наприклад,
Було → [1,4,7,2]
Стало → [1,4,7,2,2,8,14,4]
'''

import random

x = []
i = 0
while i < 4:
    x.append(random.randint(0, 100))
    i += 1
print(x)
a = [i * 2 for i in x]
print(x + a)

'''
7. Створіть список із 12 елементів.
Кожен елемент цього списку є зарплатою робітника за місяць.
Виведіть цей список на екран та обчисліть середньомісячну зарплату цього робітника.
'''

a = []
for i in range(int(input())):
    a.append(int(input()))
    print(a)
b = float(sum(a)) // 12
print('Salary:', b)

'''
8. Напишіть Python-скрипт, який виведе цю матрицю на екран, обчислить та виведе суму елементів цієї матриці.
'''
a = [[1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12], [13, 14, 15, 16]]
print(a)
sum = 0
for i in a:
    for b in i:
        if b > 0:
            sum += b
print(sum)

'''
9. Написати код для дзеркального перевороту списку
'''

a = [1, 2, 3, 4]
print(a)
a.reverse()
print(a)

'''
10. За допомогою циклів вивести на екран усі прості числа від 1 до 100.
'''

for num in range(1, 101):
    for i in range(2, num):
        if (num % i == 0):
            break
        else:
            print(num)
            break

'''
11. Виведіть на екран «пісочний годинник», максимальна ширина якого зчитується з клавіатури (число непарне).
'''
